STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_dbgmcu.h
/**
  **********************************************************************************************************************
  * @file    stm32u5xx_ll_dbgmcu.h
  * @brief   Header file of LL dbgmcu module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32U5XX_LL_DBGMCU_H
#define STM32U5XX_LL_DBGMCU_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32u5xx.h"

/** @addtogroup STM32U5xx_LL_Driver
  * @{
  */

/** @defgroup LL_DBGMCU LL DBGMCU
  * @{
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/* Exported constants ------------------------------------------------------------------------------------------------*/

/** @defgroup DBGMCU_LL_Exported_Constants DBGMCU Exported Constants
  * @{
  */

/** @defgroup DBGMCU_DEV_ID DBGMCU Device ID definition
  * @{
  */
#define LL_DBGMCU_DEV_ID_U5F5_U5G5 0x0476U /*!< STM32U5 series device STM32U5Fx/5Gx */
#define LL_DBGMCU_DEV_ID_U595_U5A5 0x0481U /*!< STM32U5 series device STM32U59x/5Ax */
#define LL_DBGMCU_DEV_ID_U575_U585 0x0482U /*!< STM32U5 series device STM32U575/585 */
#define LL_DBGMCU_DEV_ID_U535_U545 0x0455U /*!< STM32U5 series device STM32U535/545 */
/**
  * @}
  */

/** @defgroup DBGMCU_REV_ID DBGMCU Device revision ID definition
  * @{
  */
#define LL_DBGMCU_REV_ID_A 0x1000U /*!< STM32U5 device revision A                              */
#define LL_DBGMCU_REV_ID_B 0x2000U /*!< STM32U5 device revision B                              */
#define LL_DBGMCU_REV_ID_C 0x3000U /*!< STM32U5 device revision C                              */
#define LL_DBGMCU_REV_ID_X 0x2001U /*!< STM32U5 device revision X (for devices: STM32U575/585) */

#if defined(STM32U595xx) || defined(STM32U5A9xx)
#define LL_DBGMCU_REV_ID_Y 0x2001U /*!< STM32U5 device revision Y (for devices: STM32U59x/5Ax) */
#else
#define LL_DBGMCU_REV_ID_Y 0x1003U /*!< STM32U5 device revision Y (for devices: STM32U575/585) */
#endif  /* DBGMCU_APB1FZR2_DBG_I2C5_STOP */

#define LL_DBGMCU_REV_ID_Z 0x1001U /*!< STM32U5 device revision Z (for devices: STM32U575/585) */

/**
  * @}
  */

/** @defgroup DBGMCU_DEBUG_LOW_POWER_MODE DBGMCU Debug low power mode
  * @{
  */
#define LL_DBGMCU_STOP_MODE_DEBUG    DBGMCU_CR_DBG_STOP    /*!< Debug during Stop0/1/2 mode */
#define LL_DBGMCU_STANDBY_MODE_DEBUG DBGMCU_CR_DBG_STANDBY /*!< Debug during Standby mode   */
#define LL_DBGMCU_LP_MODE_DEBUG_ALL  (DBGMCU_CR_DBG_STOP | DBGMCU_CR_DBG_STANDBY)
/*!< Debug during Low power mode
 (Stop0/1/2 and Standby modes)   */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB1_GRP1_STOP_IP DBGMCU APB1 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_TIM2_STOP DBGMCU_APB1FZR1_DBG_TIM2_STOP /*!< The counter clock of TIM2 is stopped when the core
                                                                      is halted */
#define LL_DBGMCU_TIM3_STOP DBGMCU_APB1FZR1_DBG_TIM3_STOP /*!< The counter clock of TIM3 is stopped when the core
                                                                      is halted */
#define LL_DBGMCU_TIM4_STOP DBGMCU_APB1FZR1_DBG_TIM4_STOP /*!< The counter clock of TIM4 is stopped when the core
                                                                      is halted */
#define LL_DBGMCU_TIM5_STOP DBGMCU_APB1FZR1_DBG_TIM5_STOP /*!< The counter clock of TIM5 is stopped when the core
                                                                      is halted */
#define LL_DBGMCU_TIM6_STOP DBGMCU_APB1FZR1_DBG_TIM6_STOP /*!< The counter clock of TIM6 is stopped when the core
                                                                      is halted */
#define LL_DBGMCU_TIM7_STOP DBGMCU_APB1FZR1_DBG_TIM7_STOP /*!< The counter clock of TIM7 is stopped when the core
                                                                      is halted */
#define LL_DBGMCU_WWDG_STOP DBGMCU_APB1FZR1_DBG_WWDG_STOP /*!< The window watchdog counter clock is stopped when
                                                                      the core is halted      */
#define LL_DBGMCU_IWDG_STOP DBGMCU_APB1FZR1_DBG_IWDG_STOP /*!< The independent watchdog counter clock is stopped
                                                                      when the core is halted */
#define LL_DBGMCU_I2C1_STOP DBGMCU_APB1FZR1_DBG_I2C1_STOP /*!< The I2C1 SMBus timeout is frozen */
#define LL_DBGMCU_I2C2_STOP DBGMCU_APB1FZR1_DBG_I2C2_STOP /*!< The I2C2 SMBus timeout is frozen */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB1_GRP2_STOP_IP DBGMCU APB1 GRP2 STOP IP
  * @{
  */
#define LL_DBGMCU_I2C4_STOP     DBGMCU_APB1FZR2_DBG_I2C4_STOP   /*!< The I2C4 SMBus timeout is frozen */
#define LL_DBGMCU_LPTIM2_STOP   DBGMCU_APB1FZR2_DBG_LPTIM2_STOP /*!< The counter clock of LPTIM2 is stopped
                                                                            when the core is halted */
#define LL_DBGMCU_I2C5_STOP     DBGMCU_APB1FZR2_DBG_I2C5_STOP   /*!< The I2C5 SMBus timeout is frozen */
#define LL_DBGMCU_I2C6_STOP     DBGMCU_APB1FZR2_DBG_I2C6_STOP   /*!< The I2C6 SMBus timeout is frozen */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB2_GRP1_STOP_IP DBGMCU APB2 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_TIM1_STOP     DBGMCU_APB2FZR_DBG_TIM1_STOP  /*!< The counter clock of TIM1 is stopped when
                                                                          the core is halted  */
#define LL_DBGMCU_TIM8_STOP     DBGMCU_APB2FZR_DBG_TIM8_STOP  /*!< The counter clock of TIM8 is stopped when
                                                                          the core is halted  */
#define LL_DBGMCU_TIM15_STOP    DBGMCU_APB2FZR_DBG_TIM15_STOP /*!< The counter clock of TIM15 is stopped when
                                                                          the core is halted */
#define LL_DBGMCU_TIM16_STOP    DBGMCU_APB2FZR_DBG_TIM16_STOP /*!< The counter clock of TIM16 is stopped when
                                                                          the core is halted */
#define LL_DBGMCU_TIM17_STOP    DBGMCU_APB2FZR_DBG_TIM17_STOP /*!< The counter clock of TIM17 is stopped when
                                                                          the core is halted */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB3_GRP1_STOP_IP DBGMCU APB3 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_I2C3_STOP     DBGMCU_APB3FZR_DBG_I2C3_STOP   /*!< The counter clock of I2C3 is stopped when
                                                                           the core is halted   */
#define LL_DBGMCU_LPTIM1_STOP   DBGMCU_APB3FZR_DBG_LPTIM1_STOP /*!< The counter clock of LPTIM1 is stopped when
                                                                           the core is halted */
#define LL_DBGMCU_LPTIM3_STOP   DBGMCU_APB3FZR_DBG_LPTIM3_STOP /*!< The counter clock of LPTIM3 is stopped when
                                                                           the core is halted */
#define LL_DBGMCU_LPTIM4_STOP   DBGMCU_APB3FZR_DBG_LPTIM4_STOP /*!< The counter clock of LPTIM4 is stopped when
                                                                           the core is halted */
#define LL_DBGMCU_RTC_STOP      DBGMCU_APB3FZR_DBG_RTC_STOP    /*!< The counter clock of RTC is stopped when
                                                                           the core is halted    */
/**
  * @}
  */

