STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_dbgmcu.h
/** @defgroup SYSTEM_LL_EC_AHB1_GRP1_STOP_IP DBGMCU AHB1 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_GPDMA1_CH0_STOP    DBGMCU_AHB1FZR_DBG_GPDMA0_STOP  /*!< The counter clock of GPDMA1 channel 0
                                                                                 is stopped when the core is halted  */
#define LL_DBGMCU_GPDMA1_CH1_STOP    DBGMCU_AHB1FZR_DBG_GPDMA1_STOP  /*!< The counter clock of GPDMA1 channel 1
                                                                                 is stopped when the core is halted  */
#define LL_DBGMCU_GPDMA1_CH2_STOP    DBGMCU_AHB1FZR_DBG_GPDMA2_STOP  /*!< The counter clock of GPDMA1 channel 2
                                                                                 is stopped when the core is halted  */
#define LL_DBGMCU_GPDMA1_CH3_STOP    DBGMCU_AHB1FZR_DBG_GPDMA3_STOP  /*!< The counter clock of GPDMA1 channel 3
                                                                                 is stopped when the core is halted  */
#define LL_DBGMCU_GPDMA1_CH4_STOP    DBGMCU_AHB1FZR_DBG_GPDMA4_STOP  /*!< The counter clock of GPDMA1 channel 4
                                                                                 is stopped when the core is halted  */
#define LL_DBGMCU_GPDMA1_CH5_STOP    DBGMCU_AHB1FZR_DBG_GPDMA5_STOP  /*!< The counter clock of GPDMA1 channel 5
                                                                                 is stopped when the core is halted  */
#define LL_DBGMCU_GPDMA1_CH6_STOP    DBGMCU_AHB1FZR_DBG_GPDMA6_STOP  /*!< The counter clock of GPDMA1 channel 6
                                                                                 is stopped when the core is halted  */
#define LL_DBGMCU_GPDMA1_CH7_STOP    DBGMCU_AHB1FZR_DBG_GPDMA7_STOP  /*!< The counter clock of GPDMA1 channel 7
                                                                                 is stopped when the core is halted  */
#define LL_DBGMCU_GPDMA1_CH8_STOP    DBGMCU_AHB1FZR_DBG_GPDMA8_STOP  /*!< The counter clock of GPDMA1 channel 8
                                                                                 is stopped when the core is halted  */
#define LL_DBGMCU_GPDMA1_CH9_STOP    DBGMCU_AHB1FZR_DBG_GPDMA9_STOP  /*!< The counter clock of GPDMA1 channel 9
                                                                                 is stopped when the core is halted  */
#define LL_DBGMCU_GPDMA1_CH10_STOP   DBGMCU_AHB1FZR_DBG_GPDMA10_STOP /*!< The counter clock of GPDMA1 channel 10
                                                                                 is stopped when the core is halted */
#define LL_DBGMCU_GPDMA1_CH11_STOP   DBGMCU_AHB1FZR_DBG_GPDMA11_STOP /*!< The counter clock of GPDMA1 channel 11
                                                                                 is stopped when the core is halted */
#define LL_DBGMCU_GPDMA1_CH12_STOP   DBGMCU_AHB1FZR_DBG_GPDMA12_STOP /*!< The counter clock of GPDMA1 channel 12
                                                                                 is stopped when the core is halted */
#define LL_DBGMCU_GPDMA1_CH13_STOP   DBGMCU_AHB1FZR_DBG_GPDMA13_STOP /*!< The counter clock of GPDMA1 channel 13
                                                                                 is stopped when the core is halted */
#define LL_DBGMCU_GPDMA1_CH14_STOP   DBGMCU_AHB1FZR_DBG_GPDMA14_STOP /*!< The counter clock of GPDMA1 channel 14
                                                                                 is stopped when the core is halted */
#define LL_DBGMCU_GPDMA1_CH15_STOP   DBGMCU_AHB1FZR_DBG_GPDMA15_STOP /*!< The counter clock of GPDMA1 channel 15
                                                                                 is stopped when the core is halted */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_AHB3_GRP1_STOP_IP DBGMCU AHB3 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_LPDMA1_CH0_STOP    DBGMCU_AHB3FZR_DBG_LPDMA0_STOP /*!< The counter clock of LPDMA1 channel 0
                                                                                is stopped when the core is halted */
#define LL_DBGMCU_LPDMA1_CH1_STOP    DBGMCU_AHB3FZR_DBG_LPDMA1_STOP /*!< The counter clock of LPDMA1 channel 1
                                                                                is stopped when the core is halted */
#define LL_DBGMCU_LPDMA1_CH2_STOP    DBGMCU_AHB3FZR_DBG_LPDMA2_STOP /*!< The counter clock of LPDMA1 channel 2
                                                                                is stopped when the core is halted */
#define LL_DBGMCU_LPDMA1_CH3_STOP    DBGMCU_AHB3FZR_DBG_LPDMA3_STOP /*!< The counter clock of LPDMA1 channel 3
                                                                                is stopped when the core is halted */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros ------------------------------------------------------------*/

/** @defgroup DBGMCU_LL_Exported_Macros DBGMCU Exported Macros
  * @{
  */

/** @defgroup DBGMCU_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in DBGMCU register
  * @param  reg Register to be written
  * @param  value Value to be written in the register
  */
#define LL_DBGMCU_WRITE_REG(reg, value) WRITE_REG(DBGMCU->reg, (value))

/**
  * @brief  Read a value in DBGMCU register
  * @param  reg Register to be read
  * @retval Register value
  */
#define LL_DBGMCU_READ_REG(reg) READ_REG(DBGMCU->reg)

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @defgroup DBGMCU_LL_Exported_Functions LL DBGMCU functions
  * @{
  */

/** @defgroup DBGMCU_LL_EF_ID LL DBGMCU Identifications
  * @{
  */

/**
  * @brief  Return the device identifier
  * @rmtoll
  *  DBGMCU_IDCODE DEV_ID        LL_DBGMCU_GetDeviceID
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DBGMCU_DEV_ID_U5F5_U5G5
  *         @arg @ref LL_DBGMCU_DEV_ID_U595_U5A5
  *         @arg @ref LL_DBGMCU_DEV_ID_U575_U585
  *         @arg @ref LL_DBGMCU_DEV_ID_U535_U545
  */
__STATIC_INLINE uint32_t LL_DBGMCU_GetDeviceID(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->IDCODE, DBGMCU_IDCODE_DEV_ID));
}

/**
  * @brief  Return the device revision identifier
  * @rmtoll
  *  DBGMCU_IDCODE REV_ID        LL_DBGMCU_GetRevisionID
  * @note This field indicates the revision of the device.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DBGMCU_REV_ID_A
  *         @arg @ref LL_DBGMCU_REV_ID_B
  *         @arg @ref LL_DBGMCU_REV_ID_C
  *         @arg @ref LL_DBGMCU_REV_ID_X
  *         @arg @ref LL_DBGMCU_REV_ID_Y
  *         @arg @ref LL_DBGMCU_REV_ID_Z
  */
__STATIC_INLINE uint32_t LL_DBGMCU_GetRevisionID(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->IDCODE, DBGMCU_IDCODE_REV_ID) >> DBGMCU_IDCODE_REV_ID_Pos);
}

/**
  * @}
  */

/** @defgroup DBGMCU_LL_EF_LOW_POWER_MODE LL DBGMCU Debug Low power mode
  * @{
  */

/**
  * @brief  Enable the debug module during low power mode (Stop0/1/2 and standby modes)
  * @rmtoll
  *  DBGMCU_CR    DBG_STOP       LL_DBGMCU_EnableDebugLowPowerMode \n
  *  DBGMCU_CR    DBG_STANBY     LL_DBGMCU_EnableDebugLowPowerMode
  * @param mode This parameter can be one of the following values:
  *         @arg @ref  LL_DBGMCU_STOP_MODE_DEBUG
  *         @arg @ref  LL_DBGMCU_STANDBY_MODE_DEBUG
  *         @arg @ref  LL_DBGMCU_LP_MODE_DEBUG_ALL
  */
__STATIC_INLINE void LL_DBGMCU_EnableDebugLowPowerMode(uint32_t mode)
{
  SET_BIT(DBGMCU->CR, mode);
}

/**
  * @brief  Disable the debug module during low power mode (Stop0/1/2 and standby modes)
  * @rmtoll
  *  DBGMCU_CR    DBG_STOP      LL_DBGMCU_DisableDebugLowPowerMode \n
  *  DBGMCU_CR    DBG_STANBY    LL_DBGMCU_DisableDebugLowPowerMode
  * @param mode This parameter can be one of the following values:
  *         @arg @ref  LL_DBGMCU_STOP_MODE_DEBUG
  *         @arg @ref  LL_DBGMCU_STANDBY_MODE_DEBUG
  *         @arg @ref  LL_DBGMCU_LP_MODE_DEBUG_ALL
  */
__STATIC_INLINE void LL_DBGMCU_DisableDebugLowPowerMode(uint32_t mode)
{
  CLEAR_BIT(DBGMCU->CR, mode);
}

/**
  * @brief  Check if the debug module during low power mode (Stop0/1/2 and standby modes) is enabled.
  * @rmtoll
  *  DBGMCU_CR    DBG_STOP      LL_DBGMCU_IsEnabledDebugLowPowerMode \n
  *  DBGMCU_CR    DBG_STANDBY   LL_DBGMCU_IsEnabledDebugLowPowerMode
  * @param mode This parameter can be one of the following values:
  *         @arg @ref  LL_DBGMCU_STOP_MODE_DEBUG
  *         @arg @ref  LL_DBGMCU_STANDBY_MODE_DEBUG
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DBGMCU_IsEnabledDebugLowPowerMode(uint32_t mode)
{
  return ((READ_BIT(DBGMCU->CR, mode) == (mode)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the debug module during Stop0/1/2 mode
  * @rmtoll
  *  DBGMCU_CR    DBG_STOP      LL_DBGMCU_EnableDBGStopMode
  */
__STATIC_INLINE void LL_DBGMCU_EnableDBGStopMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Disable the debug module during Stop0/1/2 mode
  * @rmtoll
  *  DBGMCU_CR    DBG_STOP      LL_DBGMCU_DisableDBGStopMode
  */
__STATIC_INLINE void LL_DBGMCU_DisableDBGStopMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Check if the debug module during Stop0/1/2 mode is enabled.
  * @rmtoll
  *  DBGMCU_CR    DBG_STOP      LL_DBGMCU_IsEnabledDBGStopMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DBGMCU_IsEnabledDBGStopMode(void)
{
  return ((READ_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP) == (DBGMCU_CR_DBG_STOP)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the debug module during Standby mode
  * @rmtoll
  *  DBGMCU_CR    DBG_STANDBY   LL_DBGMCU_EnableDBGStandbyMode
  */
__STATIC_INLINE void LL_DBGMCU_EnableDBGStandbyMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY);
}

/**
  * @brief  Disable the debug module during Standby mode
  * @rmtoll
  *  DBGMCU_CR    DBG_STANDBY   LL_DBGMCU_DisableDBGStandbyMode
  */
__STATIC_INLINE void LL_DBGMCU_DisableDBGStandbyMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY);
}

/**
  * @brief  Check if the debug module during Standby mode is enabled.
  * @rmtoll
  *  DBGMCU_CR    DBG_STANDBY      LL_DBGMCU_IsEnabledDBGStandbyMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DBGMCU_IsEnabledDBGStandbyMode(void)
{
  return ((READ_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY) == (DBGMCU_CR_DBG_STANDBY)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup DBGMCU_LL_EF_FREEZE_UNFREEZE LL DBGMCU Freeze/Unfreeze
  * @{
  */

/**
  * @brief  Freeze APB1 peripherals (group1 peripherals)
  * @rmtoll
  *  DBGMCU_APB1FZR1 DBG_xxxx_STOP  LL_DBGMCU_APB1_GRP1_FreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_TIM2_STOP
  *         @arg @ref LL_DBGMCU_TIM3_STOP
  *         @arg @ref LL_DBGMCU_TIM4_STOP
  *         @arg @ref LL_DBGMCU_TIM5_STOP
  *         @arg @ref LL_DBGMCU_TIM6_STOP
  *         @arg @ref LL_DBGMCU_TIM7_STOP
  *         @arg @ref LL_DBGMCU_WWDG_STOP
  *         @arg @ref LL_DBGMCU_IWDG_STOP
  *         @arg @ref LL_DBGMCU_I2C1_STOP
  *         @arg @ref LL_DBGMCU_I2C2_STOP
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP1_FreezePeriph(uint32_t periphs)
{
  ATOMIC_SET_BIT(DBGMCU->APB1FZR1, periphs);
}

/**
  * @brief  Unfreeze APB1 peripherals (group1 peripherals)
  * @rmtoll
  *  DBGMCU_APB1FZR1 DBG_xxxx_STOP  LL_DBGMCU_APB1_GRP1_UnFreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_TIM2_STOP
  *         @arg @ref LL_DBGMCU_TIM3_STOP
  *         @arg @ref LL_DBGMCU_TIM4_STOP
  *         @arg @ref LL_DBGMCU_TIM5_STOP
  *         @arg @ref LL_DBGMCU_TIM6_STOP
  *         @arg @ref LL_DBGMCU_TIM7_STOP
  *         @arg @ref LL_DBGMCU_WWDG_STOP
  *         @arg @ref LL_DBGMCU_IWDG_STOP
  *         @arg @ref LL_DBGMCU_I2C1_STOP
  *         @arg @ref LL_DBGMCU_I2C2_STOP
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP1_UnFreezePeriph(uint32_t periphs)
{
  ATOMIC_CLEAR_BIT(DBGMCU->APB1FZR1, periphs);
}

/**
  * @brief  Freeze APB1 peripherals (group2 peripherals)
  * @rmtoll
  *  DBGMCU_APB1FZR2 DBG_xxxx_STOP  LL_DBGMCU_APB1_GRP2_FreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_I2C4_STOP
  *         @arg @ref LL_DBGMCU_LPTIM2_STOP
  *         @arg @ref LL_DBGMCU_I2C5_STOP (*)
  *         @arg @ref LL_DBGMCU_I2C6_STOP (*)
  * @note   (*) Availability depends on devices.
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP2_FreezePeriph(uint32_t periphs)
{
  ATOMIC_SET_BIT(DBGMCU->APB1FZR2, periphs);
}

/**
  * @brief  Unfreeze APB1 peripherals (group2 peripherals)
  * @rmtoll
  *  DBGMCU_APB1FZR2 DBG_xxxx_STOP  LL_DBGMCU_APB1_GRP2_UnFreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_I2C4_STOP
  *         @arg @ref LL_DBGMCU_LPTIM2_STOP
  *         @arg @ref LL_DBGMCU_I2C5_STOP (*)
  *         @arg @ref LL_DBGMCU_I2C6_STOP (*)
  * @note   (*) Availability depends on devices.
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP2_UnFreezePeriph(uint32_t periphs)
{
  ATOMIC_CLEAR_BIT(DBGMCU->APB1FZR2, periphs);
}

/**
  * @brief  Freeze APB2 peripherals
  * @rmtoll
  *  DBGMCU_APB2FZ DBG_TIMx_STOP  LL_DBGMCU_APB2_GRP1_FreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_TIM1_STOP
  *         @arg @ref LL_DBGMCU_TIM8_STOP
  *         @arg @ref LL_DBGMCU_TIM15_STOP
  *         @arg @ref LL_DBGMCU_TIM16_STOP
  *         @arg @ref LL_DBGMCU_TIM17_STOP
  */
__STATIC_INLINE void LL_DBGMCU_APB2_GRP1_FreezePeriph(uint32_t periphs)
{
  ATOMIC_SET_BIT(DBGMCU->APB2FZR, periphs);
}

/**
  * @brief  Unfreeze APB2 peripherals
  * @rmtoll
  *  DBGMCU_APB2FZR DBG_TIMx_STOP  LL_DBGMCU_APB2_GRP1_UnFreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_TIM1_STOP
  *         @arg @ref LL_DBGMCU_TIM8_STOP
  *         @arg @ref LL_DBGMCU_TIM15_STOP
  *         @arg @ref LL_DBGMCU_TIM16_STOP
  *         @arg @ref LL_DBGMCU_TIM17_STOP
  */
__STATIC_INLINE void LL_DBGMCU_APB2_GRP1_UnFreezePeriph(uint32_t periphs)
{
  ATOMIC_CLEAR_BIT(DBGMCU->APB2FZR, periphs);
}

/**
  * @brief  Freeze APB3 peripherals
  * @rmtoll
  *  DBGMCU_APB3FZ DBG_TIMx_STOP  LL_DBGMCU_APB3_GRP1_FreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_I2C3_STOP
  *         @arg @ref LL_DBGMCU_LPTIM1_STOP
  *         @arg @ref LL_DBGMCU_LPTIM3_STOP
  *         @arg @ref LL_DBGMCU_LPTIM4_STOP
  *         @arg @ref LL_DBGMCU_RTC_STOP
  */
__STATIC_INLINE void LL_DBGMCU_APB3_GRP1_FreezePeriph(uint32_t periphs)
{
  ATOMIC_SET_BIT(DBGMCU->APB3FZR, periphs);
}

/**
  * @brief  Unfreeze APB3 peripherals
  * @rmtoll
  *  DBGMCU_APB3FZR DBG_TIMx_STOP  LL_DBGMCU_APB3_GRP1_UnFreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_I2C3_STOP
  *         @arg @ref LL_DBGMCU_LPTIM1_STOP
  *         @arg @ref LL_DBGMCU_LPTIM3_STOP
  *         @arg @ref LL_DBGMCU_LPTIM4_STOP
  *         @arg @ref LL_DBGMCU_RTC_STOP
  */
__STATIC_INLINE void LL_DBGMCU_APB3_GRP1_UnFreezePeriph(uint32_t periphs)
{
  ATOMIC_CLEAR_BIT(DBGMCU->APB3FZR, periphs);
}

/**
  * @brief  Freeze AHB1 peripherals
  * @rmtoll
  *  DBGMCU_AHB1FZ DBG_GPDMAx_STOP  LL_DBGMCU_AHB1_GRP1_FreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_GPDMA1_CH0_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH1_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH2_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH3_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH4_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH5_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH6_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH7_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH8_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH9_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH10_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH11_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH12_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH13_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH14_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH15_STOP
  */
__STATIC_INLINE void LL_DBGMCU_AHB1_GRP1_FreezePeriph(uint32_t periphs)
{
  ATOMIC_SET_BIT(DBGMCU->AHB1FZR, periphs);
}

/**
  * @brief  Unfreeze AHB1 peripherals
  * @rmtoll
  *  DBGMCU_AHB1FZ DBG_GPDMAx_STOP  LL_DBGMCU_AHB1_GRP1_UnFreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_GPDMA1_CH0_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH1_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH2_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH3_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH4_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH5_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH6_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH7_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH8_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH9_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH10_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH11_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH12_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH13_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH14_STOP
  *         @arg @ref LL_DBGMCU_GPDMA1_CH15_STOP
  */
__STATIC_INLINE void LL_DBGMCU_AHB1_GRP1_UnFreezePeriph(uint32_t periphs)
{
  ATOMIC_CLEAR_BIT(DBGMCU->AHB1FZR, periphs);
}

/**
  * @brief  Freeze AHB3 peripherals
  * @rmtoll
  *  DBGMCU_AHB3FZ DBG_LPDMAx_STOP  LL_DBGMCU_AHB3_GRP1_FreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_LPDMA1_CH0_STOP
  *         @arg @ref LL_DBGMCU_LPDMA1_CH1_STOP
  *         @arg @ref LL_DBGMCU_LPDMA1_CH2_STOP
  *         @arg @ref LL_DBGMCU_LPDMA1_CH3_STOP
  */
__STATIC_INLINE void LL_DBGMCU_AHB3_GRP1_FreezePeriph(uint32_t periphs)
{
  ATOMIC_SET_BIT(DBGMCU->AHB3FZR, periphs);
}

/**
  * @brief  Unfreeze AHB3 peripherals
  * @rmtoll
  *  DBGMCU_AHB3FZ DBG_LPDMAx_STOP  LL_DBGMCU_AHB3_GRP1_UnFreezePeriph
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_LPDMA1_CH0_STOP
  *         @arg @ref LL_DBGMCU_LPDMA1_CH1_STOP
  *         @arg @ref LL_DBGMCU_LPDMA1_CH2_STOP
  *         @arg @ref LL_DBGMCU_LPDMA1_CH3_STOP
  */
__STATIC_INLINE void LL_DBGMCU_AHB3_GRP1_UnFreezePeriph(uint32_t periphs)
{
  ATOMIC_CLEAR_BIT(DBGMCU->AHB3FZR, periphs);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U5XX_LL_DBGMCU_H */
